{
  "format": "graph-model",
  "generatedBy": "2.11.1",
  "convertedBy": "TensorFlow.js Converter v4.3.0",
  "signature": {
    "outputs": {
      "feature_fusion/concat_3": {
        "name": "feature_fusion/concat_3"
      },
      "feature_fusion/Conv_7/Sigmoid": {
        "name": "feature_fusion/Conv_7/Sigmoid"
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "feature_fusion/Conv_7/weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/Conv_7/biases",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/Conv_8/weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "4"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/Conv_8/biases",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/mul_6/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_4/stack",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_4/stack_1",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_4/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/mul_4/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_2/stack",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_2/stack_1",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_2/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/mul_2/y",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice/stack",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/mul/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "resnet_v1_50/block3/unit_6/bottleneck_v1/Pad/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_1/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_1/stack_1",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_1/stack_2",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/mul_1/y",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_4/bottleneck_v1/Pad/paddings",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/concat/axis",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_3/stack",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_3/stack_1",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_3/stack_2",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/mul_3/y",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/Pad/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/concat_1/axis",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_5/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_5/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/strided_slice_5/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/mul_5/y",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/Pad/paddings",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "4"
                  },
                  {
                    "size": "2"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/concat_2/axis",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "feature_fusion/Conv_9/weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/Conv_9/biases",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/sub/y",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "feature_fusion/mul_7/y",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "feature_fusion/concat_3/axis",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "input_images",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "-1"
                },
                {
                  "size": "-1"
                },
                {
                  "size": "3"
                }
              ]
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "7"
                  },
                  {
                    "size": "7"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "2048"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/Conv_5/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "256"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2048"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "256"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "2048"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "256"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "feature_fusion/Conv_5/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "32"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "64"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "64"
                  },
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block1/unit_3/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "256"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "256"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/shortcut/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "256"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "2048"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "feature_fusion/Conv_6/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "32"
                  },
                  {
                    "size": "32"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_1/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block4/unit_3/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "2048"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "512"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_2/bottleneck_v1/conv3/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "512"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D_weights",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  },
                  {
                    "size": "1"
                  },
                  {
                    "size": "512"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv1/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D_weights",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  },
                  {
                    "size": "3"
                  },
                  {
                    "size": "128"
                  },
                  {
                    "size": "128"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "resnet_v1_50/block2/unit_3/bottleneck_v1/conv2/Conv2D_bn_offset",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
